{
  "bos_token": "<s>",
  "do_lower_case": false,
  "eos_token": "</s>",
  "model_max_length": 1000000000000000019884624838656,
  "pad_token": "[PAD]",
  "processor_class": "Wav2Vec2Processor",
  "replace_word_delimiter_char": " ",
  "special_tokens_map_file": "/mnt/shareEEx/liuxiaokang/data/pretrainmodel/wav2vec2-large-xlsr-53-chinese-zh-cn-gpt/special_tokens_map.json",
  "tokenizer_class": "Wav2Vec2CTCTokenizer",
  "unk_token": "[UNK]",
  "word_delimiter_token": "|"
}
