{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "WhisperForConditionalGeneration",
    "parent_library": "transformers.models.whisper.modeling_whisper"
  },
  "base_model_name_or_path": "/mnt/shareEEx/liuxiaokang/data/pretrainmodel/whisper-base",
  "beta1": 0.85,
  "beta2": 0.85,
  "bias": "none",
  "deltaT": 10,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "init_r": 12,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_bias": false,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "orth_reg_weight": 0.5,
  "peft_type": "ADALORA",
  "r": 8,
  "rank_pattern": null,
  "revision": null,
  "target_modules": [
    "q_proj",
    "fc1",
    "out_proj",
    "v_proj",
    "fc2",
    "k_proj"
  ],
  "target_r": 4,
  "task_type": null,
  "tfinal": 1000,
  "tinit": 200,
  "total_step": null,
  "use_dora": false,
  "use_rslora": false
}